{
    "data": [{
        "version": "2.0.1",
        "data": "28/02/2023",
        "changes": [
            "Se soluciono un problema de cálculo al mostrar los detalles de una actividad (Entrenador).",
            "Se añadió el número de ejercicios a los títulos de las pestañas de ejercicios (Entrenador).",
            "Se quito la edad de los entrenadores de las tarjetas de los comentarios.",
            "Se soluciono un problema al cargar la imagen de los usuarios al abrir la vista de más detalles (Entrenador).",
            "Se quitaron partes innecesarias del código fuente de la aplicación para aligerar el consumo de rendimiento."
        ]
    }, {
        "version": "2.0.0",
        "date": "17/02/2023",
        "changes": [
            "Se actualizaron varias librerías que integra el proyecto.",
            "Se soluciono un problema con la experiencia del teclado en la pantalla de inicio de sesión.",
            "Se optimizo el rendimiento de los componentes.",
            "Se soluciono varios problemas que afectaban a la velocidad de fotogramas.",
            "Se añadió la ventana de “Editar perfil” en el apartado del entrenador.",
            "Se reprogramo la primera pestaña del apartado del entrenador.",
            "Se creo una nueva función dentro de la API del servidor y de la app para modificar los datos de los usuarios con una cuenta de administrador.",
            "Se implemento la función de refrescar los datos una vez terminado el proceso de edición de los mismos.",
            "Se corrigieron varios errores.",
            "Se optimizo la ventana de “Ver detalles del usuario”.",
            "Se optimizo la ventana “Ver rendimiento”.",
            "Se optimizo los componentes de la ventana “Ver rendimiento”.",
            "Se corrigió un problema que hacía que las tarjetas actuaran como botones.",
            "Se modifico la ventana “Ver rendimiento” para que filtre los ejercicios por pestañas.",
            "Se corrigió el rendimiento del visor de imágenes.",
            "Se corrigió el rendimiento de la ventana “Ver todos los comentarios”.",
            "Se recreo la entrada de texto flotante para dejar comentarios.",
            "Se corrigió un error de experiencia en el listado de clientes en el apartado “Entrenadores”.",
            "Se remplazo el botón de “Añadir nuevo usuario” por un botón flotante.",
            "Se corrigió el rendimiento de la ventana “Añadir nuevo usuario”.",
            "Se recreo y rediseño la función de borrado de usuarios.",
            "Se modifico la API para que calcule por ejercicios en la ventana de “Ver rendimiento”.",
            "Se reprogramo la ventana de “Buscar cliente” para adaptarse al nuevo entorno.",
            "Se adapto la ventana de “Cargar entrenamiento” al nuevo entorno.",
            "Se recreo la ventana de “Seleccionar cliente” y se solucionaron los problemas de rendimiento de esta.",
            "Se soluciono un problema de rendimiento al renderizar la ventana “Cargar entrenamiento” al abrirse.",
            "Se añadió un margen inferior a la lista de la pestaña “Lista de ejercicios”.",
            "Se suavizo el cambio de pestañas en el apartado “Cliente”.",
            "Se optimizo mínimamente la pestaña “Mi cuenta”.",
            "Se corrigió el icono de confirmación al editar los datos de la cuenta como cliente.",
            "Se corrigieron varios errores de rendimiento en la pantalla de carga:\n- El fondo fue remplazado por un objeto (Antes era una imagen).\n- El logo se remplazó por una imagen WEBP (Antes era un SVG con imágenes PNG).\n- Se disminuyo el tiempo de carga de los mismos componentes.",
            "Se removieron 5 librerías en desuso que ocupaban espacio de almacenamiento.",
            "Se removieron, optimizaron y remplazaron varios activos del código fuente.",
            "Se corrigieron varios errores de diseño en la pantalla de carga.",
            "Se actualizo el componente de ventanas.",
            "Se remplazo la pantalla de inicio por una moderna.",
            "Se cambio el estilo de la barra de estado y navegación de la pantalla de inicio.",
            "Se añadió una animación de entrada en la pantalla de inicio.",
            "Se cambio la función de inicialización para que se ejecute luego de terminar la animación de la pantalla de inicio.",
            "Se ha reducido el peso de la aplicación considerablemente."
        ]
    }, {
        "version": "1.7.0",
        "date": "03/07/2022",
        "changes": [
            "Actualización del sistema de archivos del servidor.",
            "Nuevo sistema de optimización de imágenes.",
            "Opción de ocultar desarrollador añadida en el panel de administrador.",
            "Ver foto de perfil de los clientes en el panel de administrador.",
            "Actualización de librerías.",
            "Actualización del núcleo de la plataforma.",
            "Optimización de la API.",
            "Optimización de componentes.",
            "Optimización de la plataforma.",
            "Optimización de la arquitectura."
        ]
    }, {
        "version": "1.6.0",
        "date": "13/06/2022",
        "changes": [
            "Optimización de imágenes del fondo y perfil por defecto.",
            "Rediseño de la pantalla de carga.",
            "Solución del color de fondo en la pantalla de inicio de sesión.",
            "Nuevo componente nativo añadido “selector de fecha”.",
            "Solución de pantalla de carga infinita.",
            "Rediseño de componentes del cliente.",
            "Optimización de variables.",
            "Eliminación de pestañas “en trabajo”.",
            "Pestaña añadida “Mi cuenta”.",
            "Ventana “Opciones” movida y editada.",
            "Nueva ventana “Editar datos”.",
            "Nuevo visor de imágenes añadido.",
            "Solución de un error ocasionado al cerrar sesión.",
            "Rediseño de componentes del administrador.",
            "Edición del pie del panel de administrador.",
            "Nuevo diseño de ventanas flotantes.",
            "Nuevas animaciones de ventanas.",
            "Experiencia de usuario mejorada.",
            "Solución al verificar datos al cargar entrenamientos.",
            "Nueva ventana añadida “Selección de cliente”.",
            "Opción de búsqueda al cargar entrenamientos añadida.",
            "Finalización de la prueba beta de “Editar ejercicio”.",
            "Nueva pestaña añadida “Opciones” en el panel administrador.",
            "Nuevo sistema de opciones implementado.",
            "Función de ocultar administradores añadida.",
            "Funciones adicionales añadidas.",
            "Solución de errores generales.",
            "Respuestas al servidor optimizadas.",
            "Inteligencia del servidor actualizada.",
            "Sistema de optimización de imágenes finalizada (servidor).",
            "Filtro de datos de entrenamientos cambiado (por fecha).",
            "Filtro de datos de comentarios cambiado (por fecha de entrenamiento)."
        ]
    }, {
        "version": "1.5.0",
        "date": "29/05/2022",
        "changes": [
            "Corrección de errores.",
            "Corrección de errores de interfaz.",
            "Se cambio el sistema de estadísticas (por ejercicio).",
            "Se cambio el sistema de cálculos de la vista “detalles”.",
            "Se añadió nuevos elementos en la sección clientes.",
            "Se añadió un sistema de notificaciones.",
            "Se actualizo la lista de iconos.",
            "Nuevos componentes.",
            "Actualización de la interfaz de usuario.",
            "Actualización de la experiencia de usuario."
        ]
    }, {
        "version": "1.4.1",
        "date": "21/05/2022",
        "changes": [
            "Solucion de error de conexion."
        ]
    }, {
        "version": "1.4",
        "date": "21/05/2022",
        "changes": [
            "Corrección de errores.",
            "Corrección de errores de interfaz.",
            "Nuevos componentes.",
            "Actualización de componentes.",
            "Nueva ventana de información en el menú de opciones.",
            "Nuevo cartel de dialogo para actualizar la aplicación.",
            "Nueva función para administradores: “Editar ejercicios (Beta)”.",
            "Nueva función para administradores: “Filtrar administradores”.",
            "Nueva función para administradores: “Ver cantidad de ejercicios de los usuarios”.",
            "Nueva función para administradores: “Nueva barra de opciones en el menú plegable”."
        ]
    }, {
        "version": "1.3.0",
        "date": "17/05/2022",
        "changes": [
            "Corrección de errores.",
            "Correcciones de la interfaz administrador.",
            "Cambios en el menú de opciones.",
            "Nuevos componentes.",
            "Nuevo apartado de cambios."
        ]
    }, {
        "version": "1.2.0",
        "date": "16/05/2022",
        "changes": [
            "Corrección de errores.",
            "Correcciones de la interfaz.",
            "Adaptación del diseño para pantallas pequeñas."
        ]
    }, {
        "version": "1.1.0",
        "date": "14/05/2022",
        "changes": [
            "Mejoras de rendimiento.",
            "Resolución de varios errores.",
            "Nuevos apartados y ventanas.",
            "En progreso muchas funciones."
        ]
    }, {
        "version": "1.0.0",
        "date": "26/04/2022",
        "changes": [
            "Bienvenidos al nuevo lanzamiento de nuestra aplicación."
        ]
    }]
}